In [1]:
import pandas as pd
import numpy as np

1.Define and create a Dataframe using Pandas.

In [16]:
df = pd.DataFrame({'name':['vinay','kushal','Aman','Saif'],
                  'age':[22,25,24,28]
                  ,"occupation":['engineer','doctor','data analyst','teacher']})
print(df)

     name  age    occupation
0   vinay   22      engineer
1  kushal   25        doctor
2    Aman   24  data analyst
3    Saif   28       teacher

2. How can we calculate the standard deviation from the series.

In [7]:
s=pd.Series([2,4,5,6,9])
print(s)
print(s.std())

0    2
1    4
2    5
3    6
4    9
dtype: int64
2.5884358211089573

3. Create a Dataframe using List given below:
lis=[‘Python’,’Numpy’,’Pandas’]

In [5]:
lis=['Python','Numpy','Pandas']
D=pd.Series([lis])
print(D)

0    [Python, Numpy, Pandas]
dtype: object

4. Create a Series from dictionary given below:
info = {'x' : 0., 'y' : 1., 'z' : 2.}

In [13]:
info = {'x' : 0., 'y' : 1., 'z' : 2.}  
a = pd.Series(info)  
print (a)

x    0.0
y    1.0
z    2.0
dtype: float64

5. How will you create an empty Dataframe in Pandas?

In [15]:
a = pd.DataFrame() 
print(a)
a['Name'] = ['Ankit', 'Ankita', 'Yashvardhan']
a['Articles'] = [97, 600, 200]
a['Improved'] = [2200, 75, 100]
print(a)

Empty DataFrame
Columns: []
Index: []
          Name  Articles  Improved
0        Ankit        97      2200
1       Ankita       600        75
2  Yashvardhan       200       100

6. i) Add a column to that pandas Dataframe that you created in Q1
ii) Change index of that Dataframe.

In [18]:
df['place']=['Hyd','Delhi','Mumbai','Bhubaneswar']
print(df)
df.set_index('place')

     name  age    occupation        place
0   vinay   22      engineer          Hyd
1  kushal   25        doctor        Delhi
2    Aman   24  data analyst       Mumbai
3    Saif   28       teacher  Bhubaneswar

               name  age    occupation
place
Hyd           vinay   22      engineer
Delhi        kushal   25        doctor
Mumbai         Aman   24  data analyst
Bhubaneswar    Saif   28       teacher

7. Get the following from this dataframe:
import random
A = [ random.randint(0,100) for i in range(10) ]
B = [ random.randint(0,100) for i in range(10) ]
df = pd.DataFrame({ 'field_A': A, 'field_B': B })
i) mean
ii) median
iii) mode
iv) 75th percentile
v) 90th percentile
vi) 99th percentile

In [24]:
import random
A = [ random.randint(0,100) for i in range(10) ]
B = [ random.randint(0,100) for i in range(10) ]
df = pd.DataFrame({ 'field_A': A, 'field_B': B })
print(df)

print("The Data for field_A are: ")
print("i) mean :",df.field_A.mean())  
print("ii) median",df.field_A.median())
print("iii) mode",df.field_A.mode())
print("iv) 75th percentile",df.field_A.quantile(0.75)) 
print("v) 90th percentile",df.field_A.quantile(0.9))
print("vi) 99th percentile",df.field_A.quantile(0.99)) 

print("\nThe Data for field_B are: ")
print("i) mean :",df.field_B.mean())  
print("ii) median",df.field_B.median())
print("iii) mode",df.field_B.mode())
print("iv) 75th percentile",df.field_B.quantile(0.75)) 
print("v) 90th percentile",df.field_B.quantile(0.9))
print("vi) 99th percentile",df.field_B.quantile(0.99))

   field_A  field_B
0       88       77
1       18       74
2       20       14
3       95       60
4       42        2
5       38       27
6       98       42
7       38       52
8       17        4
9        0       69
The Data for field_A are:
i) mean : 45.4
ii) median 38.0
iii) mode 0    38
dtype: int64
iv) 75th percentile 76.5
v) 90th percentile 95.3
vi) 99th percentile 97.72999999999999

The Data for field_B are:
i) mean : 42.1
ii) median 47.0
iii) mode 0     2
1     4
2    14
3    27
4    42
5    52
6    60
7    69
8    74
9    77
dtype: int64
iv) 75th percentile 66.75
v) 90th percentile 74.3
vi) 99th percentile 76.72999999999999

8. How do you count how many unique rows a DataFrame has (i.e.
ignore all rows that are duplicates)?

In [26]:
data = { 
        'node1': [2,2,2,3,3,5,5],
        'node2': [8,16,22,5,25,10,77],
        'weight': [1,1,1,1,1,1,1], }
ds = pd.DataFrame(data, columns = ['node1','node2','weight'])

print(ds["node1"].value_counts())

2    3
5    2
3    2
Name: node1, dtype: int64

9. How to keep only top 2 most frequent values as it is and replace
everything else as ‘Other’? Take the following as input.
np.random.RandomState(100)
ser = pd.Series(np.random.randint(1, 5, [12]))

In [27]:
np.random.RandomState(100)
num_series = pd.Series(np.random.randint(1, 5, [15]))
print("Original Series:")
print(num_series)
print("Top 2 Freq:", num_series.value_counts())
result = num_series[~num_series.isin(num_series.value_counts().index[:1])] = 'Other'
print(num_series)

Original Series:
0     2
1     3
2     2
3     2
4     3
5     1
6     2
7     3
8     2
9     1
10    4
11    4
12    4
13    4
14    1
dtype: int32
Top 2 Freq: 2    5
4    4
3    3
1    3
dtype: int64
0         2
1     Other
2         2
3         2
4     Other
5     Other
6         2
7     Other
8         2
9     Other
10    Other
11    Other
12    Other
13    Other
14    Other
dtype: object

10. A DataFrame has a column of groups 'grps' and and column of
integer values 'vals':
df = pd.DataFrame({'grps':
list('aaabbcaabcccbbc'),
'vals': [12, 345, 3, 1, 45, 14 , 4, 52, 54, 23, 235,
21, 57, 3, 87]})
For each group, find the sum of the three greatest values. You
should end up with the answer as follows:
grps
a 409
b 156
c 345

In [32]:
df = pd.DataFrame({'grps':list('aaabbcaabcccbbc'),
'vals': [12, 345, 3, 1, 45, 14 , 4, 52, 54, 23, 235,21, 57, 3, 87]})
print(df)
print(df.groupby('grps').apply(lambda x: x.vals.nlargest(3).sum()))

   grps  vals
0     a    12
1     a   345
2     a     3
3     b     1
4     b    45
5     c    14
6     a     4
7     a    52
8     b    54
9     c    23
10    c   235
11    c    21
12    b    57
13    b     3
14    c    87
grps
a    409
b    156
c    345
dtype: int64

*Create a dataframe for the following to answer the next few questions
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat',
'snake', 'cat', 'dog', 'dog'],
'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no',
'no']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [75]:
data= {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat',
'snake', 'cat', 'dog', 'dog'],
'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no',
'no']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df=pd.DataFrame(data,index=labels)
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

11. Display a summary of the basic information about this
DataFrame and its data (hint: there is a single method that can
be called on the DataFrame).

In [38]:
print("Summary of the basic information about this DataFrame and its data:")
print(df.info())

Summary of the basic information about this DataFrame and its data:
<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   animal    10 non-null     object
 1   age       8 non-null      float64
 2   visits    10 non-null     int64
 3   priority  10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes
None

12. Select the rows where the age is between 2 and 4 (inclusive).

In [39]:
print("Rows where the age is between 2 and 4(inclusive):")
print(df[df['age'].between(2,4)])

Rows where the age is between 2 and 4(inclusive):
  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
f    cat  2.0       3       no
j    dog  3.0       1       no

13. Select the data in rows [3, 4, 8] and in columns ['animal', 'age'].

In [41]:
print("Select specific columns and rows:")
print(df.iloc[[3,4,8], [0,1]])

Select specific columns and rows:
  animal  age
d    dog  NaN
e    dog  5.0
i    dog  7.0

14. Select the rows where the age is missing, i.e. it is NaN.

In [42]:
print("Rows where age is missing:")
print(df[df['age'].isnull()])

Rows where age is missing:
  animal  age  visits priority
d    dog  NaN       3      yes
h    cat  NaN       1      yes

15. Select the rows where the animal is a cat and the age is less than
3.

In [44]:
print(df[(df['animal'] == 'cat') & (df['age'] < 3)])

  animal  age  visits priority
a    cat  2.5       1      yes
f    cat  2.0       3       no

16. Change the age in row 'f' to 1.5.

In [60]:
df.loc['f','age']=1.5
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  1.5       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

17. In the 'animal' column, change the 'snake' entries to 'python'.

In [76]:
df['animal'] = df['animal'].replace('snake', 'python')
df

   animal  age  visits priority
a     cat  2.5       1      yes
b     cat  3.0       3      yes
c  python  0.5       2       no
d     dog  NaN       3      yes
e     dog  5.0       2       no
f     cat  2.0       3       no
g  python  4.5       1       no
h     cat  NaN       1      yes
i     dog  7.0       2       no
j     dog  3.0       1       no

18. Count the number of each type of animal in df.

In [77]:
df.groupby("animal").count()

        age  visits  priority
animal
cat       3       4         4
dog       3       4         4
python    2       2         2

19. The 'priority' column contains the values 'yes' and 'no'. Replace
this column with a column of boolean values: 'yes' should
be True and 'no' should be False.`

In [78]:
print("\nReplace the 'priority' column contains the values 'yes' and 'no'  with True and  False:")
df['priority'] = df['priority'].map({'yes': True, 'no': False})
print(df)

Replace the 'priority' column contains the values 'yes' and 'no'  with True and  False:
   animal  age  visits  priority
a     cat  2.5       1      True
b     cat  3.0       3      True
c  python  0.5       2     False
d     dog  NaN       3      True
e     dog  5.0       2     False
f     cat  2.0       3     False
g  python  4.5       1     False
h     cat  NaN       1      True
i     dog  7.0       2     False
j     dog  3.0       1     False

20. For each animal type and each number of visits, find the mean
age. In other words, each row is an animal, each column is a
number of visits and the values are the mean ages (hint: use a
pivot table).

In [81]:
df.pivot_table(index='animal', columns='visits', values='age', aggfunc='mean')

visits    1    2    3
animal
cat     2.5  NaN  2.5
dog     3.0  6.0  NaN
python  4.5  0.5  NaN